turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c/atdf/ATSAM4C4C_1.atdf
        <register caption="Interrupt Status Register" name="ADC_ISR" offset="0x30" rw="R" size="4">
          <bitfield caption="End of Conversion 0 (automatically set/cleared)" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1 (automatically set/cleared)" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2 (automatically set/cleared)" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3 (automatically set/cleared)" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4 (automatically set/cleared)" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5 (automatically set/cleared)" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6 (automatically set/cleared)" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7 (automatically set/cleared)" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Temperature Change (cleared on read)" mask="0x00080000" name="TEMPCHG"/>
          <bitfield caption="Data Ready (automatically set/cleared)" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error (cleared on read)" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event (cleared on read)" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Transfer (automatically set/cleared)" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full (automatically set/cleared)" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Temperature Sensor Mode Register" name="ADC_TEMPMR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Temperature Sensor ON" mask="0x00000001" name="TEMPON"/>
          <bitfield caption="Temperature Comparison Mode" mask="0x00000030" name="TEMPCMPMOD" values="ADC_TEMPMR__TEMPCMPMOD"/>
        </register>
        <register caption="Temperature Compare Window Register" name="ADC_TEMPCWR" offset="0x38" rw="RW" size="4">
          <bitfield caption="Temperature Low Threshold" mask="0x00000FFF" name="TLOWTHRES"/>
          <bitfield caption="Temperature High Threshold" mask="0x0FFF0000" name="THIGHTHRES"/>
        </register>
        <register caption="Overrun Status Register" name="ADC_OVER" offset="0x3C" rw="R" size="4">
          <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00000010" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00000020" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
        </register>
        <register caption="Extended Mode Register" name="ADC_EMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Comparison Mode" mask="0x00000003" name="CMPMODE" values="ADC_EMR__CMPMODE"/>
          <bitfield caption="Comparison Selected Channel" mask="0x000000F0" name="CMPSEL"/>
          <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
          <bitfield caption="Compare Event Filtering" mask="0x00003000" name="CMPFILTER"/>
          <bitfield caption="Over Sampling Rate" mask="0x00030000" name="OSR" values="ADC_EMR__OSR"/>
          <bitfield caption="Averaging on Single Trigger Event" mask="0x00100000" name="ASTE" values="ADC_EMR__ASTE"/>
          <bitfield caption="TAG of the ADC_LDCR register" mask="0x01000000" name="TAG"/>
        </register>
        <register caption="Compare Window Register" name="ADC_CWR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x00000FFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0x0FFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Channel Data Register 0" name="ADC_CDR0" offset="0x50" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 1" name="ADC_CDR1" offset="0x54" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 2" name="ADC_CDR2" offset="0x58" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 3" name="ADC_CDR3" offset="0x5C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 4" name="ADC_CDR4" offset="0x60" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 5" name="ADC_CDR5" offset="0x64" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 6" name="ADC_CDR6" offset="0x68" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Channel Data Register 7" name="ADC_CDR7" offset="0x6C" rw="R" size="4">
          <bitfield caption="Converted Data" mask="0x00000FFF" name="DATA"/>
        </register>
        <register caption="Analog Control Register" name="ADC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="Internal Reference Voltage Change Enable" mask="0x00000004" name="IRVCE" values="ADC_ACR__IRVCE"/>
          <bitfield caption="Internal Reference Voltage Selection" mask="0x00000078" name="IRVS"/>
          <bitfield caption="Force Internal Reference Voltage" mask="0x00080000" name="FORCEREF"/>
          <bitfield caption="Internal Voltage Reference ON" mask="0x00100000" name="ONREF"/>
        </register>
