turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c/atdf/ATSAM4C4C_1.atdf
                <register offset="0x0000030f" size="1" name="NVICIP15" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI15" caption="Priority of interrupt 15"/>
                </register>
                <register offset="0x00000310" size="1" name="NVICIP16" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI16" caption="Priority of interrupt 16"/>
                </register>
                <register offset="0x00000311" size="1" name="NVICIP17" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI17" caption="Priority of interrupt 17"/>
                </register>
                <register offset="0x00000312" size="1" name="NVICIP18" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI18" caption="Priority of interrupt 18"/>
                </register>
                <register offset="0x00000313" size="1" name="NVICIP19" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI19" caption="Priority of interrupt 19"/>
                </register>
                <register offset="0x00000314" size="1" name="NVICIP20" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI20" caption="Priority of interrupt 20"/>
                </register>
                <register offset="0x00000315" size="1" name="NVICIP21" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI21" caption="Priority of interrupt 21"/>
                </register>
                <register offset="0x00000316" size="1" name="NVICIP22" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI22" caption="Priority of interrupt 22"/>
                </register>
                <register offset="0x00000317" size="1" name="NVICIP23" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI23" caption="Priority of interrupt 23"/>
                </register>
                <register offset="0x00000318" size="1" name="NVICIP24" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI24" caption="Priority of interrupt 24"/>
                </register>
                <register offset="0x00000319" size="1" name="NVICIP25" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI25" caption="Priority of interrupt 25"/>
                </register>
                <register offset="0x0000031a" size="1" name="NVICIP26" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI26" caption="Priority of interrupt 26"/>
                </register>
                <register offset="0x0000031b" size="1" name="NVICIP27" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI27" caption="Priority of interrupt 27"/>
                </register>
                <register offset="0x0000031c" size="1" name="NVICIP28" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI28" caption="Priority of interrupt 28"/>
                </register>
                <register offset="0x0000031d" size="1" name="NVICIP29" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI29" caption="Priority of interrupt 29"/>
                </register>
                <register offset="0x0000031e" size="1" name="NVICIP30" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI30" caption="Priority of interrupt 30"/>
                </register>
                <register offset="0x0000031f" size="1" name="NVICIP31" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI31" caption="Priority of interrupt 31"/>
                </register>
                <register offset="0x00000320" size="1" name="NVICIP32" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI32" caption="Priority of interrupt 32"/>
                </register>
                <register offset="0x00000321" size="1" name="NVICIP33" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI33" caption="Priority of interrupt 33"/>
                </register>
                <register offset="0x00000322" size="1" name="NVICIP34" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI34" caption="Priority of interrupt 34"/>
                </register>
                <register offset="0x00000323" size="1" name="NVICIP35" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI35" caption="Priority of interrupt 35"/>
                </register>
                <register offset="0x00000324" size="1" name="NVICIP36" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI36" caption="Priority of interrupt 36"/>
                </register>
                <register offset="0x00000325" size="1" name="NVICIP37" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI37" caption="Priority of interrupt 37"/>
                </register>
                <register offset="0x00000326" size="1" name="NVICIP38" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI38" caption="Priority of interrupt 38"/>
                </register>
                <register offset="0x00000327" size="1" name="NVICIP39" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI39" caption="Priority of interrupt 39"/>
                </register>
                <register offset="0x00000328" size="1" name="NVICIP40" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI40" caption="Priority of interrupt 40"/>
                </register>
                <register offset="0x00000329" size="1" name="NVICIP41" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI41" caption="Priority of interrupt 41"/>
                </register>
                <register offset="0x0000032a" size="1" name="NVICIP42" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI42" caption="Priority of interrupt 42"/>
                </register>
                <register offset="0x0000032b" size="1" name="NVICIP43" initval="0" caption="Interrupt Priority Register n">
                    <bitfield mask="0x000000ff" name="PRI43" caption="Priority of interrupt 43"/>
                </register>
